app/Controllers/Cart.php

SELECT *
FROM `products`
WHERE `products`.`id` = 2
---
    public function add()
    {
        $productId = (int) $this->request->getPost('product_id');
        $qty       = (int) ($this->request->getPost('qty') ?? 1);

        if ($productId <= 0 || $qty <= 0) {
            return $this->jsonError('Invalid product.');
        }

        $product = (new ProductModel())->find($productId);