app/Controllers/Products.php

    public function index(): string
    {
        $productModel = new ProductModel();
        $cartModel    = new CartModel();

        // Read filter params
        $filters = [
            'category'  => $this->request->getGet('category') ?? '',
            'price_min' => $this->request->getGet('price_min') ?? '',
            'price_max' => $this->request->getGet('price_max') ?? '',
            'sort'      => $this->request->getGet('sort') ?? 'popular',
        ];

        $perPage  = 12;
        $page     = (int) ($this->request->getGet('page') ?? 1);
        $offset   = ($page - 1) * $perPage;
        $total    = $productModel->countActive($filters);
        $products = $productModel->getActive($filters, $perPage, $offset);

        // Fetch categories for sidebar
        $categories = $this->db->table('categories')
            ->where('is_active', 1)
            ->get()->getResultArray();
---
SELECT *
FROM `categories`
WHERE `is_active` = 1