app/Models/CartModel.php

SELECT *
FROM `cart`
WHERE `product_id` = 2
AND `session_id` = '95f27cbfce8f4e86d9fbe4fc83a9f989'
AND `user_id` IS NULL
 LIMIT 1
UPDATE `cart` SET `quantity` = 2, `updated_at` = '2026-04-18 10:26:07'
WHERE `cart`.`id` IN ('94')
INSERT INTO `cart` (`user_id`, `session_id`, `product_id`, `quantity`, `created_at`, `updated_at`) VALUES (NULL, 'f83b7bde2b2a01ba9b442ba0ec7d3b7e', 2, 1, '2026-04-18 10:25:10', '2026-04-18 10:25:10')
---
    public function addItem(int $productId, int $qty = 1): void
    {
        $userId    = session()->get('user_id');
        $sessionId = session_id();

        // Search for existing cart item
        if ($userId) {
            $existing = $this->where('product_id', $productId)
                ->where('user_id', $userId)
                ->first();
        } else {
            $existing = $this->where('product_id', $productId)
                ->where('session_id', $sessionId)
                ->where('user_id', null)
                ->first();
        }

        if ($existing) {
            $this->update($existing['id'], ['quantity' => $existing['quantity'] + $qty]);
        } else {
            $this->insert([
                'user_id'    => $userId,
                'session_id' => $sessionId,
                'product_id' => $productId,
                'quantity'   => $qty,
            ]);

DELETE FROM `cart`
WHERE `id` IN (93)
---
    public function removeItem(int $cartId): void
    {
        $this->delete($cartId);