app/Models/ProductModel.php

SELECT `p`.*, `c`.`name` AS `category_name`
FROM `products` `p`
LEFT JOIN `categories` `c` ON `c`.`id` = `p`.`category_id`
WHERE `p`.`is_active` = 1
ORDER BY `p`.`id` DESC
 LIMIT 4
---
    public function getActive(array $filters = [], int $limit = 0, int $offset = 0): array
    {
        $builder = $this->db->table('products p')
            ->select('p.*, c.name AS category_name')
            ->join('categories c', 'c.id = p.category_id', 'left')
            ->where('p.is_active', 1);

        if (! empty($filters['category'])) {
            $builder->where('c.slug', $filters['category']);
        }
        if (! empty($filters['price_max'])) {
            $builder->where('p.price <=', (float) $filters['price_max']);
        }
        if (! empty($filters['price_min'])) {
            $builder->where('p.price >=', (float) $filters['price_min']);
        }
        if (! empty($filters['sort'])) {
            match ($filters['sort']) {
                'price-asc'  => $builder->orderBy('p.price', 'ASC'),
                'price-desc' => $builder->orderBy('p.price', 'DESC'),
                'new'        => $builder->orderBy('p.id', 'DESC'),
                default      => $builder->orderBy('p.id', 'ASC'),
            };
        }

        if ($limit > 0) {
            $builder->limit($limit, $offset);
        }

        return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `products` `p`
LEFT JOIN `categories` `c` ON `c`.`id` = `p`.`category_id`
WHERE `p`.`is_active` = 1
---
    public function countActive(array $filters = []): int
    {
        $builder = $this->db->table('products p')
            ->join('categories c', 'c.id = p.category_id', 'left')
            ->where('p.is_active', 1);

        if (! empty($filters['category'])) {
            $builder->where('c.slug', $filters['category']);
        }

        return (int) $builder->countAllResults();